cfd/wing_baseline/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<case>/caseParameters"

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         $nIterations;

deltaT          1;

writeControl    timeStep;

writeInterval   $writeInterval;

purgeWrite      2;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #include "forceCoeffs"

    solverInfo
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (U p k omega);
        writeResidualFields no;
        writeControl    timeStep;
        writeInterval   1;
    }

    yPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        patches         (wing);
        writeControl    writeTime;
    }
}

// ************************************************************************* //
