cfd/wing_baseline/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<case>/caseParameters"

scale   1;

nx  #eval{ round(($xMax - $xMin)/$baseCell) };
ny  #eval{ round(($yMax - $yMin)/$baseCell) };
nz  #eval{ round(($zMax - $zMin)/$baseCell) };

vertices
(
    ($xMin $yMin $zMin)
    ($xMax $yMin $zMin)
    ($xMax $yMax $zMin)
    ($xMin $yMax $zMin)
    ($xMin $yMin $zMax)
    ($xMax $yMin $zMax)
    ($xMax $yMax $zMax)
    ($xMin $yMax $zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    symmetry        // y = 0, wing root plane
    {
        type symmetryPlane;
        faces ((0 1 5 4));
    }
    side            // y = yMax, beyond the tip
    {
        type patch;
        inGroups (farfield);
        faces ((3 7 6 2));
    }
    bottom
    {
        type patch;
        inGroups (farfield);
        faces ((0 3 2 1));
    }
    top
    {
        type patch;
        inGroups (farfield);
        faces ((4 5 6 7));
    }
);

// ************************************************************************* //
