cfd/wing_baseline/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<case>/caseParameters"

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    // output/wing_outer_mold_line.stl scaled mm -> m by Allrun
    wing.stl
    {
        type    triSurfaceMesh;
        name    wing;
    }

    nearWing        // hugs the half wing (x 0..0.59, y 0..1.0)
    {
        type    box;
        min     (-0.15  0     -0.10);
        max     ( 0.75  1.10   0.15);
    }

    wake            // tilted up a little: the wake follows the inflow at alpha
    {
        type    box;
        min     (-0.50  0     -0.30);
        max     ( 3.00  1.30   0.60);
    }
}

castellatedMeshControls
{
    maxLocalCells       10000000;
    maxGlobalCells      60000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;

    features
    (
        {
            file    "wing.eMesh";
            level   $featureLevel;
        }
    );

    refinementSurfaces
    {
        wing
        {
            level   $surfaceLevel;
            patchInfo
            {
                type wall;
            }
        }
    }

    resolveFeatureAngle 15;

    refinementRegions
    {
        nearWing
        {
            mode    inside;
            levels  ((1e15 $nearLevel));
        }
        wake
        {
            mode    inside;
            levels  ((1e15 $wakeLevel));
        }
    }

    locationInMesh (-2.031 2.017 2.113);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2.0;
    nSolveIter      100;
    nRelaxIter      5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes       true;

    layers
    {
        wing
        {
            nSurfaceLayers  $nLayers;
        }
    }

    expansionRatio      1.2;
    finalLayerThickness 0.4;
    minThickness        0.1;
    nGrow               0;
    featureAngle        130;
    slipFeatureAngle    30;
    nRelaxIter          5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals      3;
    nSmoothThickness    10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle  90;
    nBufferCellsNoExtrude 0;
    nLayerIter          50;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-15;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;

    relaxed
    {
        maxNonOrtho     75;
    }
}

mergeTolerance 1e-6;

// ************************************************************************* //
