cfd/wing_baseline/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<case>/caseParameters"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInf;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           uniform $omegaInf;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $omegaInf;
        value           uniform $omegaInf;
    }
    farfield
    {
        type            inletOutlet;
        inletValue      uniform $omegaInf;
        value           uniform $omegaInf;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    wing
    {
        type            omegaWallFunction;
        value           uniform $omegaInf;
    }
}

// ************************************************************************* //
